# ModernBlog Development Environment - Homebrew Bundle

# Taps
tap "homebrew/cask"
tap "hashicorp/tap"
tap "mongodb/brew"

# Development Tools
brew "git"
brew "gh"                    # GitHub CLI
brew "git-lfs"              # Git Large File Storage
brew "lefthook"             # Git hooks manager

# Languages and Runtimes
brew "node"                 # Node.js
brew "python@3.11"          # Python
brew "go"                   # Go programming language
brew "rust"                 # Rust programming language

# Container and Orchestration
brew "docker"               # Docker CLI
brew "docker-compose"       # Docker Compose
brew "kubectl"              # Kubernetes CLI
brew "kind"                 # Kubernetes in Docker
brew "helm"                 # Kubernetes package manager
brew "skaffold"             # Kubernetes development workflow
brew "kustomize"            # Kubernetes configuration management

# Database Tools
brew "postgresql@16"        # PostgreSQL client
brew "redis"                # Redis client
brew "mongodb-community"    # MongoDB

# Infrastructure as Code
brew "terraform"            # Infrastructure provisioning
brew "terragrunt"           # Terraform wrapper
brew "terraform-docs"       # Generate Terraform documentation
brew "tflint"              # Terraform linter
brew "tfsec"               # Terraform security scanner
brew "infracost"           # Cloud cost estimation

# Cloud Provider CLIs
brew "awscli"              # AWS CLI
brew "azure-cli"           # Azure CLI
cask "google-cloud-sdk"    # Google Cloud SDK

# Development Utilities
brew "jq"                  # JSON processor
brew "yq"                  # YAML processor
brew "httpie"              # HTTP client
brew "curl"                # Data transfer tool
brew "wget"                # File retrieval
brew "tree"                # Directory visualization
brew "watch"               # Execute programs periodically
brew "tmux"                # Terminal multiplexer
brew "fzf"                 # Fuzzy finder
brew "ripgrep"             # Fast grep alternative
brew "bat"                 # Better cat
brew "exa"                 # Modern ls replacement
brew "fd"                  # Fast find alternative
brew "direnv"              # Directory-specific environments

# Code Quality Tools
brew "golangci-lint"       # Go linter
brew "hadolint"            # Dockerfile linter
brew "shellcheck"          # Shell script linter
brew "yamllint"            # YAML linter
brew "pre-commit"          # Git pre-commit framework

# Monitoring and Debugging
brew "k9s"                 # Kubernetes TUI
brew "stern"               # Multi-pod log tailing
brew "kubectx"             # Switch between clusters
brew "dive"                # Docker image explorer
brew "lazydocker"          # Docker TUI
brew "htop"                # Process viewer
brew "ctop"                # Container metrics

# Security Tools
brew "cosign"              # Container signing
brew "trivy"               # Vulnerability scanner
brew "vault"               # Secret management

# CI/CD Tools
brew "act"                 # Run GitHub Actions locally
brew "dagger"              # Portable CI/CD pipelines

# Documentation
brew "hugo"                # Static site generator
brew "pandoc"              # Document converter

# Casks (GUI Applications)
cask "docker"              # Docker Desktop
cask "visual-studio-code"  # VS Code
cask "postman"             # API development
cask "tableplus"           # Database GUI
cask "lens"                # Kubernetes IDE
cask "insomnia"            # REST client
cask "ngrok"               # Secure tunnels