# ModernBlog Development Environment Brewfile
# Complete Mac dependencies for cloud-native development

# Core development tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "yq"

# Programming languages and runtimes
brew "go"
brew "node@20"
brew "python@3.11"

# Container and orchestration tools
cask "docker"
brew "kubectl"
brew "kind"
brew "skaffold"
brew "helm"
brew "k9s"
brew "stern"
brew "kubectx"

# Infrastructure as Code
brew "terraform"
brew "tflint"
brew "terragrunt"

# CI/CD and automation
brew "dagger"
brew "github/gh/gh"

# Code quality and linting
brew "golangci-lint"
brew "hadolint"
brew "yamllint"
brew "shellcheck"

# Database tools
brew "postgresql"
brew "redis"
brew "pgcli"

# Development utilities
brew "htop"
brew "tree"
brew "watch"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"
brew "direnv"

# Network and debugging tools
brew "httpie"
brew "netcat"
brew "tcpdump"
brew "wireshark"

# Text processing
brew "awk"
brew "sed"
brew "grep"

# Container analysis
brew "dive"
brew "cosign"
brew "syft"
brew "grype"

# Cloud CLI tools (optional)
tap "azure/functions"
brew "awscli"
cask "google-cloud-sdk"
brew "azure-cli"

# IDE and editors
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Communication and documentation
cask "slack"
cask "notion"
cask "obsidian"

# Browsers for testing
cask "google-chrome"
cask "firefox"

# System utilities
cask "rectangle"
cask "alfred"
cask "iterm2"

# Optional AI development tools
tap "anthropic/claude"
brew "anthropic/claude/claude-code"

# Security tools
brew "gnupg"
brew "age"
brew "sops"

# Performance monitoring
brew "htop"
brew "iotop"
brew "nettop"

# File compression
brew "gzip"
brew "unzip"
brew "tar"

# Image processing
brew "imagemagick"
brew "ffmpeg"

# Version control
brew "git-lfs"
brew "pre-commit"

# Package managers
brew "yarn"
brew "pnpm"

# API development
cask "postman"
brew "grpcurl"